{
  "scenario": "Werewolves Game",
  "description": "This game is called Werewolves (also known as Mafia), which is a social deduction game.  GAME STRUCTURE: This game contains six players: two villagers, two werewolves, one seer, and one witch. Each cycle consists of Night phases followed by Day phases. WIN CONDITIONS: Villagers win by eliminating all Werewolves. Werewolves win when they equal or outnumber the Villagers. NIGHT PHASES: (1) Werewolves wake and privately choose one Villager to kill using 'kill NAME'. (2) The Seer wakes and inspects one player using 'inspect NAME' to learn if they are a Werewolf or Villager. (3) The Witch wakes and may use their one-time save potion with 'save NAME' (if someone died tonight) or their one-time poison potion with 'poison NAME' to kill someone. DAY PHASES: (1) Dawn: All players learn who died during the night (if any). (2) Discussion: All living players go *one* round of public discussion to discuss and debate who might be a Werewolf. Use 'speak' to share your thoughts and suspicions. (3) Voting: Each player votes to eliminate one suspected Werewolf using 'vote NAME'. The player with the most votes is executed. (4) Twilight: The execution result is announced and night returns. COMMUNICATION RULES: All day discussions are public. Dead players cannot speak or act. If 'action' is available, use commands like 'kill NAME', 'inspect NAME', 'save NAME', 'poison NAME', or 'vote NAME'. Note: Player actions in the nights are not seen by players of other roles (e.g. only wolves can see other wolves' actions). Day discussion is public. Voting requires an 'action' beginning with 'vote'.\n\n The players in this game are: {agent_names}, and during the day, they speak in the same order as they are listed.",
  "role_goals": {
    "Villager": "Act openly and collaboratively to identify werewolves.",
    "Werewolf": "Deceive others, avoid detection, and eliminate villagers.",
    "Seer": "Discreetly inspect players at night to uncover werewolves.",
    "Witch": "Use save/poison potions strategically to aid villagers."
  },
  "role_secrets": {
    "Werewolf": "I am a werewolf."
  },
  "initial_state": "Night_werewolf",
  "state_transition": {
    "Night_werewolf": "Night_seer",
    "Night_seer": "Night_witch",
    "Night_witch": "Day_discussion",
    "Day_discussion": "Day_vote",
    "Day_vote": "Night_werewolf"
  },
  "state_properties": {
    "Night_werewolf": {
      "acting_roles": [
        "Werewolf"
      ],
      "actions": [
        "action"
      ],
      "visibility": "team"
    },
    "Night_seer": {
      "acting_roles": [
        "Seer"
      ],
      "actions": [
        "action"
      ],
      "visibility": "private"
    },
    "Night_witch": {
      "acting_roles": [
        "Witch"
      ],
      "actions": [
        "action"
      ],
      "visibility": "private",
      "internal_state": {
        "save_available": true,
        "poison_available": true
      }
    },
    "Day_discussion": {
      "actions": [
        "speak"
      ],
      "action_order": "round-robin",
      "visibility": "public"
    },
    "Day_vote": {
      "actions": [
        "action"
      ],
      "action_order": "simultaneous",
      "visibility": "public"
    }
  },
  "end_conditions": [
    {
      "type": "team_eliminated",
      "team": "Werewolves",
      "winner": "Villagers",
      "message": "Villagers win; no werewolves remain."
    },
    {
      "type": "parity",
      "team": "Werewolves",
      "other": "Villagers",
      "winner": "Werewolves",
      "message": "Werewolves win; they now match the village."
    }
  ]
}
