[
    {
        "codename": "job_interview_cooperative",
        "source": "job_interview",
        "scenario": "This is a negotiation between a job recruiter and a job candidate regarding the details of a job offer after the candidate has received the offer. [Extra information] The recruiter has just been informed that an equally qualified candidate on the waitlist is willing to accept the offer and negotiate the same terms. Meanwhile, the candidate has received a final offer from another equally prestigious company, with the same terms to be negotiated.",
        "agent_goals": ["You are the Hiring Manager. The job candidate has already received a job offer from your company, and now you will be discussing the final agreement. \nSalary:  the job candidate’s salary can range from $100,000 to $120,000. There are 5 different amounts you and the job candidate can agree on, and each is associated with a different number of points for you. $120,000 gets you 0 points, $115,000 gets you 1500 points, $110,000 gets you 3000 points, $105,000 gets you 4500 points, and $100,000 gets you 6000 points.\nStarting Date: the job candidate’s starting date can range from June 1 to August 1. There are 5 different dates you and the job candidate can agree on, and each is associated with a different number of points for you. June 1 gets you 0 points, June 15 gets you 600 points, July 1 gets you 1200 points, July 15 gets you 1800 points, and August 1 gets you 2400 points.\nThese are the only choices you have, and you cannot offer other bonuses. Do not, at any time, tell the other person how many points you are getting. Also, do not let the other negotiator see your points. This information is strictly private to you. [IMPORTANT] The maximum points you can get is 8400, and the minimum is 0. Given the unpredictability of the negotiation, you should be careful in making your decisions, as moving on to the next step will take extra time, and you may end up with the same results." , "You are the job candidate for the company. A position has already been offered, and you will be negotiating with the hiring manager on the following concerns. \nSalary: Your salary can range from $100,000 to $120,000. There are 5 different amounts you can agree on, each associated with a different number of points for you. $120,000 gives you 6000 points, $115,000 gives you 4500 points, $110,000 gives you 3000 points, $105,000 gives you 1500 points, and $100,000 gives you 0 points. \nStarting Date: Your starting date can range from June 1 to August 1. There are 5 different dates you can agree on, each associated with a different number of points for you. June 1 gives you 800 points, June 15 gives you 600 points, July 1 gives you 400 points, July 15 gives you 200 points, and August 1 gives you 0 points.\nThese are the only choices you have and you cannot request for other bonuses. Do not, at any time, tell the other person how many points you are getting. Also, do not let the other negotiator see your points. The information is strictly private to you. [IMPORTANT] The maximum points you can get is 6800, and the minimum is 0. Given that every negotiation is unpredictable, you should be careful in making your decisions, as moving on to the next step will take extra time, and you may end up with the same results."]
    }
]