{
  "scenario": "This game is called Werewolves (also known as Mafia), which is a social deduction game.  GAME STRUCTURE: This game contains six players: two villagers, two werewolves, one seer, and one witch. Each cycle consists of Night phases followed by Day phases. WIN CONDITIONS: Villagers win by eliminating all Werewolves. Werewolves win when they equal or outnumber the Villagers. NIGHT PHASES: (1) Werewolves wake and privately choose one Villager to kill using 'kill NAME'. (2) The Seer wakes and inspects one player using 'inspect NAME' to learn if they are a Werewolf or Villager. (3) The Witch wakes and may use their one-time save potion with 'save NAME' (if someone died tonight) or their one-time poison potion with 'poison NAME' to kill someone. DAY PHASES: (1) Dawn: All players learn who died during the night (if any). (2) Discussion: All living players openly discuss and debate who might be a Werewolf. Use 'speak' to share your thoughts and suspicions. (3) Voting: Each player votes to eliminate one suspected Werewolf using 'vote NAME'. The player with the most votes is executed. (4) Twilight: The execution result is announced and night returns. COMMUNICATION RULES: All day discussions are public. Dead players cannot speak or act. STRATEGY: Villagers must use logic, observation, and deduction to identify Werewolves through their behavior and voting patterns. Werewolves must deceive others, blend in as Villagers, and create confusion. Special roles (Seer, Witch) should use their powers strategically without revealing themselves too early. Trust is earned through consistent behavior and alignment of words with actions.",
  "players": [
    {
      "first_name": "Aurora",
      "last_name": "Harper",
      "role": "Villager",
      "public_role": "Villager",
      "age": 54,
      "pronouns": "she/her",
      "goal": "Keep discussion orderly and support executions only when evidence feels solid."
    },
    {
      "first_name": "Bram",
      "last_name": "Nightshade",
      "role": "Werewolf",
      "public_role": "Villager",
      "age": 33,
      "pronouns": "he/him",
      "goal": "Blend in with confident speech while steering suspicion toward ordinary villagers.",
      "secret": "You are a werewolf working with Dorian. Coordinate night kills."
    },
    {
      "first_name": "Celeste",
      "last_name": "Moonseer",
      "role": "Seer",
      "public_role": "Villager",
      "age": 29,
      "pronouns": "she/her",
      "goal": "Inspect one player per night and nudge the village toward the wolves."
    },
    {
      "first_name": "Dorian",
      "last_name": "Blackwood",
      "role": "Werewolf",
      "public_role": "Villager",
      "age": 38,
      "pronouns": "he/him",
      "goal": "Support Bram's stories and pressure outspoken villagers into missteps.",
      "secret": "You are a werewolf working with Bram. Coordinate night kills."
    },
    {
      "first_name": "Elise",
      "last_name": "Farrow",
      "role": "Witch",
      "public_role": "Villager",
      "age": 41,
      "pronouns": "she/her",
      "goal": "Use your save and poison sparingly; protect confirmed villagers and strike when a wolf is exposed."
    },
    {
      "first_name": "Finn",
      "last_name": "Alder",
      "role": "Villager",
      "public_role": "Villager",
      "age": 36,
      "pronouns": "he/him",
      "goal": "Track inconsistencies and rally the town to execute the most suspicious player each day."
    }
  ]
}
